# SweepBaseRoofSubcategoryId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SweepBaseRoofSubcategoryId Property
ParameterTypeId Class See Also
---
"Subcategory of Roofs"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SweepBaseRoofSubcategoryId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SweepBaseRoofSubcategoryId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SweepBaseRoofSubcategoryId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace